examples_3D_Simulations/5_3D_RM6_PTO_damping_mid/constant/waveInput.txt
waveHeights
1
...
wavePeriods
1
...
wavePhases
1
...
waveAngles
1
...
waveDirs
1
...
